victorzhengg/nrf5_sdk_17_1_0/examples/ble_central_and_peripheral/ble_app_mns/main.c
/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {BSP_BUTTON_0, false, BUTTON_PULL, button_event_handler},
				{BSP_BUTTON_1, false, BUTTON_PULL, button_event_handler},
				{BSP_BUTTON_2, false, BUTTON_PULL, button_event_handler},
				{BSP_BUTTON_3, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


static void mns_timer_handler(void * p_context)
{
		ble_gatts_value_t     gatt_value;
	  uint16_t index;
	
		local_mns_cnt++;
	  m_mnss_data.counter_value = local_mns_cnt;
	
		gatt_value.len = sizeof(ble_mnss_data_t);
		gatt_value.p_value = (uint8_t *)&m_mnss_data;
		gatt_value.offset = 0;
	  for(index=0;index<m_periph_link_cnt;index++)
		{
				sd_ble_gatts_value_set(m_conn_handle[index],
															 m_mnss.data_read_handle.value_handle, 
															 &gatt_value);
		}
}

/**@brief Function for handling Scaning events.
 *
 * @param[in]   p_scan_evt   Scanning event.
 */
static void scan_evt_handler(scan_evt_t const * p_scan_evt)
{
    ret_code_t err_code;

    switch(p_scan_evt->scan_evt_id)
    {
        case NRF_BLE_SCAN_EVT_CONNECTING_ERROR:
            err_code = p_scan_evt->params.connecting_err.err_code;
            APP_ERROR_CHECK(err_code);
            break;
        default:
          break;
    }
}

static void scan_init(void)
{
    ret_code_t          err_code;
    nrf_ble_scan_init_t init_scan;

    memset(&init_scan, 0, sizeof(init_scan));

    init_scan.connect_if_match = true;
    init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

    err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
    APP_ERROR_CHECK(err_code);

    // Setting filters for scanning.
    err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_NAME_FILTER, false);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_NAME_FILTER, m_target_periph_name);
    APP_ERROR_CHECK(err_code);	
}
	
static void db_discovery_init(void)
{
}

static void scan_start(void)
{
}


/**@brief Handles events coming from the LED Button central module.
 */
static void mnss_c_evt_handler(ble_mnss_c_t * p_mnss_c, ble_mnss_c_evt_t * p_mnss_c_evt)
{
    switch (p_mnss_c_evt->evt_type)
    {
        case BLE_MNSS_C_EVT_DISCOVERY_COMPLETE:
        {
            ret_code_t err_code;

            err_code = ble_mnss_c_handles_assign(&m_ble_mnss_c,
                                                p_mnss_c_evt->conn_handle,
                                                &p_mnss_c_evt->params.peer_db);
						APP_ERROR_CHECK(err_code);
					
						NRF_LOG_INFO("mnss_c_evt_handler: BLE_LBS_C_EVT_DISCOVERY_COMPLETE");
        } break; // BLE_LBS_C_EVT_DISCOVERY_COMPLETE

        case BLE_MNSS_C_EVT_WRITE:
        {
            NRF_LOG_INFO("BLE_MNSS_C_EVT_WRITE.");
 
        } break; // BLE_LBS_C_EVT_BUTTON_NOTIFICATION

				case BLE_MNSS_C_EVT_READ:
        {
            NRF_LOG_INFO("BLE_MNSS_C_EVT_READ");
 
        } break; // BLE_LBS_C_EVT_BUTTON_NOTIFICATION
				
        default:
            // No implementation needed.
            break;
    }
}

/**@brief Function for handling the LED Button Service client errors.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void mnss_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    ret_code_t         err_code;
    ble_mnss_init_t    init     = {0};
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize LBS.
    init.data_write_handler = mnss_write_handler;

		
		/*peripheral service initial*/
    err_code = ble_mnss_init(&m_mnss, &init);
    APP_ERROR_CHECK(err_code);
		
		
		/*central service initial*/
    ble_mnss_c_init_t mnss_c_init_obj;

    mnss_c_init_obj.evt_handler   = mnss_c_evt_handler;
    mnss_c_init_obj.p_gatt_queue  = &m_ble_gatt_queue;
    mnss_c_init_obj.error_handler = mnss_error_handler;

    err_code = ble_mnss_c_init(&m_ble_mnss_c, &mnss_c_init_obj);
    APP_ERROR_CHECK(err_code);
}



/**@brief Function for application main entry.
 */
int main(void)
{
		uint32_t err_code;
    // Initialize.
    log_init();
    leds_init();
	
    timers_init();
		app_timer_create(&m_mns_timer, APP_TIMER_MODE_REPEATED, mns_timer_handler);
		app_timer_start(m_mns_timer, MNS_TIMER_PERIOD, NULL);
	
    buttons_init();
		err_code = app_button_enable();
		APP_ERROR_CHECK(err_code);
	
    power_management_init();
    ble_stack_init();
		scan_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
		db_discovery_init();
    

    // Start execution.
    NRF_LOG_INFO("Multi Node Synchronize example started.");
		scan_start();
    advertising_start();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
